Revit 2027 API
KeyBasedTreeEntryTable.ServerSupports Method
 Checks if the server referenced by the given ExternalResourceReference supports the ExternalResourceReferenceType of this KeyBasedTreeEntryTable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ServerSupports(
	ExternalResourceReference extRef
)
Public Function ServerSupports (
	extRef As ExternalResourceReference
) As Boolean
public:
bool ServerSupports(
	ExternalResourceReference^ extRef
)
member ServerSupports :
        extRef : ExternalResourceReference -> bool
Parameters
extRef ExternalResourceReference
 The ExternalResourceReference to check.
Return Value
Boolean
 True if the ExternalResourceReference refers to a server that supports the ExternalResourceReferenceType of this KeyBasedTreeEntryTable. False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
KeyBasedTreeEntryTable Class
Autodesk.Revit.DB Namespace